Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_bus.h
/**
  * @brief  Enable APB2 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM19 
  *         @arg @ref LL_APB2_GRP1_PERIPH_RNG   
  *         @arg @ref LL_APB2_GRP1_PERIPH_COMP  
  *         @arg @ref LL_APB2_GRP1_PERIPH_OPA   
  *         @arg @ref LL_APB2_GRP1_PERIPH_LCDC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_EnableClock(uint32_t Periphs)
{
  __IO uint32_t tmpreg;
  SET_BIT(RCC->APB2ENR, Periphs);
  /* Delay after an RCC peripheral clock enabling */
  tmpreg = READ_BIT(RCC->APB2ENR, Periphs);
  (void)tmpreg;
}

/**
  * @brief  Check if APB2 GRP1 peripheral clock is enabled or not
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM19 
  *         @arg @ref LL_APB2_GRP1_PERIPH_RNG   
  *         @arg @ref LL_APB2_GRP1_PERIPH_COMP  
  *         @arg @ref LL_APB2_GRP1_PERIPH_OPA   
  *         @arg @ref LL_APB2_GRP1_PERIPH_LCDC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval State of Periphs (1 or 0).
  */
__STATIC_INLINE uint32_t LL_APB2_GRP1_IsEnabledClock(uint32_t Periphs)
{
  return ((READ_BIT(RCC->APB2ENR, Periphs) == (Periphs)) ? 1UL : 0UL);
}

/**
  * @brief  Disable APB2 GRP1 peripherals clock.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM19 
  *         @arg @ref LL_APB2_GRP1_PERIPH_RNG   
  *         @arg @ref LL_APB2_GRP1_PERIPH_COMP  
  *         @arg @ref LL_APB2_GRP1_PERIPH_OPA   
  *         @arg @ref LL_APB2_GRP1_PERIPH_LCDC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_DisableClock(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2ENR, Periphs);
}

/**
  * @brief  Force APB2 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM19 
  *         @arg @ref LL_APB2_GRP1_PERIPH_RNG   
  *         @arg @ref LL_APB2_GRP1_PERIPH_COMP  
  *         @arg @ref LL_APB2_GRP1_PERIPH_OPA   
  *         @arg @ref LL_APB2_GRP1_PERIPH_LCDC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ForceReset(uint32_t Periphs)
{
  SET_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @brief  Release APB2 GRP1 peripherals reset.
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_APB2_GRP1_PERIPH_ALL   
  *         @arg @ref LL_APB2_GRP1_PERIPH_SYSCFG
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC2  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_SPI1  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM8  
  *         @arg @ref LL_APB2_GRP1_PERIPH_USART1
  *         @arg @ref LL_APB2_GRP1_PERIPH_ADC3  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM9  
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM10 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM11 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM15 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM16 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM17 
  *         @arg @ref LL_APB2_GRP1_PERIPH_TIM19 
  *         @arg @ref LL_APB2_GRP1_PERIPH_RNG   
  *         @arg @ref LL_APB2_GRP1_PERIPH_COMP  
  *         @arg @ref LL_APB2_GRP1_PERIPH_OPA   
  *         @arg @ref LL_APB2_GRP1_PERIPH_LCDC  
  * @note   Depending on devices and packages, some peripherals may not be available.
  *         Refer to device datasheet for peripherals availability.
  * @note (*) peripheral not available on all devices
  * @retval None
  */
__STATIC_INLINE void LL_APB2_GRP1_ReleaseReset(uint32_t Periphs)
{
  CLEAR_BIT(RCC->APB2RSTR, Periphs);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* RCC */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32E407_LL_BUS_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE****/
